package studyreview.week1.day2;

public class AboutPackage {

//	패키지 생성시 주의사항
//
//	1. 한 패키지 내에 동일한 이름의 패키지들이 중복 불가
//	2. 패키지 명은 항상 소문자로 적어야 함(클래스명의 앞 글자가 항상 대문자이기 때문에 구분하기 용이함)
//	3. 기본 패키지에(즉 src 폴더에)클래스를 만드는 게 가능은 하지만 권장되지는 않음 → 찾기 힘들기 때문
//	4. 한 패키지 내에 동일한 이름의 클래스들이 중복 불가
//	   단, 서로 다른 패키지 내에 동일한 이름의 클래스들은 존재 가능
	
	
//	패키지 생성시 권장 사항
//
//	1. 패키지는 적어도 세 단계 이상으로 만들어 줄 것(ex, com.kh.first)
//	2. 두번째 레벨까지는 회사 도메인의 역순으로 쓸 것
//	   (고유한 주소값이기 때문에 중복 방지할 수 있고, 패키지만 봐도 어디서 제작한 프로젝트인지 파악 가능)
//	   ex ) [www.google.com](http://www.google.com/) => com.google.*
//
//	 → 둘 다 Spring Framework에서 만든 규칙이기 때문
	
}
