package studyreview.week1.day2;

public class AboutMethod {

//	메소드 :  사전적인 정의로 "기능"을 의미함, 하나의 기능 단위
//
//	1. 메소드는 일반 메소드와 main 메소드로 나뉨
//	    - main 메소드 : 내가 만든 프로그램의 시작점을 나타내는 메소드
//	    JVM에 의해 실행됨(호출됨)
//	    pubic static void main(String[] args) { }
//	        
//	    - 일반 메소드 : 내가 만들고 싶은 기능 단위별로 만들면 됨
//	    main 메소드이든 일반 메소드이든 간에 다른 메소드에서 실행시켜줘야 함
//	    pubic void 메소드명() { }
//	        
//	    - 메소드 실행시키는 것을 "호출(call)"이라고 한다
//	2. 한 개의 클래스 안에 여러 메소드들이 존재 가능
//	   단, 표면적으로는 메소드명이 중복될 수는 없음
//	   - 특별한 규칙에 의해 메소드명이 중복될 수 있음 : 오버로딩 overloading
//	3. 한 클래스 내에 여러 개의 메소드를 정의해 둘 수 있음
//	    
//	    무조건 메인 메소드를 포함할 필요도 없음
	
}
